      MVI A.0 ;реден број на корисникот
      STA RDN_BR
      MVI E,255d
VRTI: MOV A,E ;јамка за 255 корисника
      ANI FFh
      JNZ VRTI ;сите интерапти се случуваат тука
      HLT ;крај на програмата
      END

 RDN_BR DS 1 ;променлива каде се чува редниот број на корисникот
;има само 4B меморија наменета за интерапт рутините (премалку), па затоа повикуваме
процедура (CALL=3B, RET=1B)
2Ch: CALL SERVIS_55 ;на адреса 2Ch, наменета за RST 5.5
     RET
34h: CALL SERVIS_65 ;на адреса 34h, наменета за RST 6.5
     RET
SERVIS_55: MVI A,1 ;на дисплеј се испишува бројот на шалтер
           OUT 01h
           LDA RDN_BR ;се вчитува редниот број на корисникот
           INR A ;се зголемува за 1, се запишува во
соодветната мемориска локација и се испишува на втоориот дисплеј
           STA RDN_BR
           OUT 02h
           DCR E ;еден корисник помалку
           RET
SERVIS_65: MVI A,2d ;на дисплеј се испишува бројот на шалтер
           OUT 01h
           LDA RDN_BR ;се вчитува редниот број на корисникот
           INR A ;се зголемува за 1, се запишува во
соодветната мемориска локација и се испишува на втоориот дисплеј
           STA RDN_BR
           OUT 02h
           DCR E ;еден корисник помалку
